from random import randint
s = {
'Нидерланды':'Амстердам',
'Греция':'Афины',
'Сербия':'Белград',
'Германия':'Берлин',
'Швейцария':'Берн',
'Словакия':'Братислава',
'Бельгия':'Брюссель',
'Венгрия':'Будапешт',
'Румыния':'Бухарест',
'Лихтенштейн':'Вадуц',
'Мальта':'Валлетта',
'Польша':'Варшава',
'Ватикан':'Ватикан',
'Австрия':'Вена',
'Литва':'Вильнюс',
'Ирландия':'Дублин',
'Хорватия':'Загреб',
'Украина':'Киев',
'Молдавия':'Кишинёв',
'Дания':'Копенгаген',
'Португалия':'Лиссабон',
'Великобритания':'Лондон',
'Словения':'Любляна',
'Люксембург':'Люксембург',
'Испания':'Мадрид',
'Белоруссия':'Минск',
'Монако':'Монако',
'Россия':'Москва',
'Норвегия':'Осло',
'Франция':'Париж',
'Черногория':'Подгорица',
'Чехия':'Прага',
'Исландия':'Рейкьявик',
'Латвия':'Рига',
'Италия':'Рим',
'Сан-Марино':'Сан-Марино',
'Босния и Герцеговина':'Сараево',
'Северная Македония':'Скопье',
'Болгария':'София',
'Швеция':'Стокгольм',
'Эстония':'Таллин',
'Албания':'Тирана',
'Финляндия':'Хельсинки'
}
countries= []
capitles = []
used=[]
a = 0
var = input('Start- ')
for key in s:
    countries.append(key)
    capitles.append(s[key])

def find():
    used = []
    count = 0
    while True:
        a = randint(0,len(countries)-1)
        while countries[a] not in used:
            print('type capitаl of ',countries[a])
            var = input('- ')
            if capitles[a] == var or var == 'Читы':
                used.append(countries[a])
                print('correct')
                count += 1
            else:
                print('incorrect',capitles[a])
                used.append(countries[a])
        if len(used) == (len(countries)-1):
            print('you got ',(count*100)/(len(countries)-1),'%')
            print('NEXT TRY')
            used = []
            find()
        if var == 'Старт':
            for i in range(0,101):
                print('restarting',i,'%')
                if i >= 100:
                    used = []
                    find()
            
if var == 'Старт':
    find()











        
